In [51]:
#load data set 
#data set 1
import csv

data = [
    ['StudentID','Name','Marks'],
    [101,'Alice',85],
    [102,'Bob',90],
    [103,'Charlie',88],
    [104,'David',92],
]

file_path = 'example.csv'

# Writing the data to CSV
with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    writer.writerows(data)

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'example.csv' created successfully.

'example.csv'

In [53]:
import pandas as pd
df=pd.read_csv(r"C:\Users\gadar\Documents\example.csv")

In [55]:
df

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [57]:
#load data set 2
# data set 2
import csv
import pandas

dataa = [
    ['StudentID','Age','Grade'],
    [101,20,'A'],
    [102,21,'B'],
    [103,22,'A'],
    [105,19,'C']
]

file_path = 'details.csv'

# Writing the data to CSV
with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    writer.writerows(dataa)

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'details.csv' created successfully.

'details.csv'

In [59]:
dc=pd.read_csv(r"C:\Users\gadar\Documents\details.csv")

In [61]:
dc

   StudentID  Age Grade
0        101   20     A
1        102   21     B
2        103   22     A
3        105   19     C

In [63]:
pd.DataFrame(df)

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88
3        104    David     92

In [65]:
pd.DataFrame(dc)

   StudentID  Age Grade
0        101   20     A
1        102   21     B
2        103   22     A
3        105   19     C

In [67]:
#Mergeing using right join
merged_df=pd.merge(dc,df,on='StudentID',how='right')


"""Right Join (how='right'): Includes all rows from the right dataframe (df) and the matching rows from the left dataframe (dc).
If there is no match, the result will contain NaN for columns from the left dataframe."""

"Right Join (how='right'): Includes all rows from the right dataframe (df) and the matching rows from the left dataframe (dc).\nIf there is no match, the result will contain NaN for columns from the left dataframe."

In [69]:
merged_df

   StudentID   Age Grade     Name  Marks
0        101  20.0     A    Alice     85
1        102  21.0     B      Bob     90
2        103  22.0     A  Charlie     88
3        104   NaN   NaN    David     92

In [71]:
#Mergeing using left join
merged_df=pd.merge(dc,df,on='StudentID',how='left')


"""Left Join (how='left'): Includes all rows from the left dataframe (dc) and the matching rows from the right dataframe (df). 
If there is no match, the result will contain NaN for columns from the right dataframe."""

"Left Join (how='left'): Includes all rows from the left dataframe (dc) and the matching rows from the right dataframe (df). \nIf there is no match, the result will contain NaN for columns from the right dataframe."

In [73]:
merged_df

   StudentID  Age Grade     Name  Marks
0        101   20     A    Alice   85.0
1        102   21     B      Bob   90.0
2        103   22     A  Charlie   88.0
3        105   19     C      NaN    NaN

In [75]:
#merging using inner join
merged_df=pd.merge(dc,df,on ='StudentID',how='inner')

"""Inner Join (how='inner'): Includes only the rows that have matching values in both dataframes (dc and df) based on the 'StudentID' column.
If there is no match, the row is excluded from the result.
1.Inner Join results in the intersection of the two dataframes.
"""

"Inner Join (how='inner'): Includes only the rows that have matching values in both dataframes (dc and df) based on the 'StudentID' column.\nIf there is no match, the row is excluded from the result.\n1.Inner Join results in the intersection of the two dataframes.\n"

In [77]:
merged_df

   StudentID  Age Grade     Name  Marks
0        101   20     A    Alice     85
1        102   21     B      Bob     90
2        103   22     A  Charlie     88

In [125]:
#merging using outer join
merged_df=pd.merge(dc,df,on='StudentID',how='outer')

"""Outer Join (how='outer'): Includes all rows from both dataframes (dc and df).
If there is no match, the result will contain NaN for the columns where there is no corresponding data in the other dataframe
2.Outer Join results in the union of the two dataframes.
"""

"Outer Join (how='outer'): Includes all rows from both dataframes (dc and df).\nIf there is no match, the result will contain NaN for the columns where there is no corresponding data in the other dataframe\n2.Outer Join results in the union of the two dataframes.\n"

In [127]:
merged_df

   StudentID   Age Grade     Name  Marks
0        101  20.0     A    Alice   85.0
1        102  21.0     B      Bob   90.0
2        103  22.0     A  Charlie   88.0
3        104   NaN   NaN    David   92.0
4        105  19.0     C      NaN    NaN

In [129]:
#student id set to index
merged_df.set_index('StudentID', inplace=True)
merged_df

            Age Grade     Name  Marks
StudentID
101        20.0     A    Alice   85.0
102        21.0     B      Bob   90.0
103        22.0     A  Charlie   88.0
104         NaN   NaN    David   92.0
105        19.0     C      NaN    NaN

In [131]:
#index reset as previous
merged_df.reset_index('StudentID', inplace=True)
merged_df

   StudentID   Age Grade     Name  Marks
0        101  20.0     A    Alice   85.0
1        102  21.0     B      Bob   90.0
2        103  22.0     A  Charlie   88.0
3        104   NaN   NaN    David   92.0
4        105  19.0     C      NaN    NaN

In [135]:
#load data set 
#data set 1
import csv

data = [
    ['StudentID','Name','Marks'],
    [101,'Alice',85],
    [102,'Bob',90],
    [103,'Charlie',88],
    [104,'David',92],
]

file_path = 'example.csv'

# Writing the data to CSV
with open(file_path, 'w', newline='') as csv_file:
    writer = csv.writer(csv_file)
    writer.writerows(data)

print(f"CSV file '{file_path}' created successfully.")
file_path

CSV file 'example.csv' created successfully.

'example.csv'

In [ ]:



""" 
Difference between all of them

1.Left Join (how='left'):

    Includes all rows from the left dataframe (dc).

    Matches rows from the right dataframe (df) based on 'StudentID'.

    Rows from dc without matches in df will have NaN in the columns from df.


2.Right Join (how='right'):

   Includes all rows from the right dataframe (df).

   Matches rows from the left dataframe (dc) based on 'StudentID'.

   Rows from df without matches in dc will have NaN in the columns from dc.


3.Inner Join (how='inner'):

    Includes only rows with matching 'StudentID' values in both dataframes (dc and df).

    Rows without matches in either dataframe are excluded.


4.Outer Join (how='outer'):

    Includes all rows from both dataframes (dc and df).

    Matches rows based on 'StudentID'.

    Rows without matches in either dataframe will have NaN in the columns from the other dataframe."""